// Lab_03_1.cpp
// < Парастатова Дарина >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 16
#include <iostream>
#include <cmath>
const double M_E = 2.71828;
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	cout << "Enter please, x = "; cin >> x;
	A = 5 * pow(M_E, 3 * x); //підрахунок сталої частини
	// спосіб 1: розгалуження в скороченій формі
	if (x < -1)
		B = sqrt(2) * pow(x, 3) - 7; //якщо х < -1 за умовою
	if (-1 <= x && x < 3)
		B = 2 * log10(1 - x / 4);
	if (x >= 3)
		B = cos(abs(x)) + 3;
	y = A - B; //підрахунок повного виразу
	cout << endl;
	cout << "1) y = " << y << endl;
	// спосіб 2: розгалуження в повній формі
	if (x < -1)
		B = sqrt(2) * pow(x, 3) - 7;
	else
		if (-1 <= x && x < 3)
			B = 2 * log10(1 - x / 4);
		else
			B = cos(abs(x)) + 3;
	y = A - B;
	cout << "2) y = " << y << endl;
	cin.get();
	system("pause");
	return 0;
}
